Revit 2026 API

# InsulationTypeName Property

---

Get name of Insulation type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override string Name { set; }
```
```vb
Public Overrides WriteOnly Property Name As String
	Set
```
```cpp
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```
```fsharp
abstract Name : string with set
override Name : string with set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Set name can't be supported. |

#### Reference

InsulationType Class

Autodesk.Revit.DB.Electrical Namespace